## Plan Result (sbox-aks-mis)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.uami_cft_rg_identity_operator[&#34;00&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.uami_cft_rg_identity_operator["00"] must be replaced
-/+ resource "azurerm_role_assignment" "uami_cft_rg_identity_operator" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/managed-identities-sandbox-rg/providers/Microsoft.Authorization/roleAssignments/2b9907b0-5025-2648-8fa8-0c63b9b0aba4" -> (known after apply)
      ~ name                             = "2b9907b0-5025-2648-8fa8-0c63b9b0aba4" -> (known after apply)
      ~ principal_id                     = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" -> "e86e2fb7-97e1-43f6-88c8-5f97a1d45cac" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":480,"Program":"tfcmt","SHA1":"","Target":"sbox-aks-mis","Vars":{}} -->